Revit 2027 API
BuiltInFailures.GeneralFailures.FailedToOpenFile Property
 Failed to open file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedToOpenFile { get; }
Public Shared ReadOnly Property FailedToOpenFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedToOpenFile {
	FailureDefinitionId^ get ();
}
static member FailedToOpenFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace